from flask import Flask

app = Flask(__name__)

from app import routes

@app.route('/')
def hello_world():
    return 'Hello, World!'

if __name__ == '__main__':
    app.run()

# Δε χρειάζεσαι κάτι πέρα από αυτό. Και αυτό πολύ είναι
# Δλδ μια συνάρτηση θες που να επιστρέφει τα δικά σου.
# Και μετά απλά τρέχεις το φλασκ βάζεις ένα endpoint και είσαι έτοιμος.
# Πρώτο βήμα φτιάχνεις τον κώδικα που φορτώνει το μοντέλο μια φορά και
# φτιάχνεις μια συνάρτηση που παίρνει μια ερώτηση και επιστρέφει απαντήσεις όπως είπαμε